adimalla/clTerm/Examples/Tiva_Launchpad_123gxl/custom_drivers/peripheral_drivers/inc/mcu_tm4c123gh6pm.h
/*
 * @brief Peripheral Register Structures
 */



/*
 * @brief System Control Register Structure
 */
typedef struct system_control
{
    __IO uint32_t DID0;             /*!< Device Identification 0,                                                           Address offset: 0x000          */
    __IO uint32_t DID1;             /*!< Device Identification 1,                                                           Address offset: 0x004          */
    __I  uint32_t LEGACY[10];       /*!< Legacy Registers,                                                                  Address offset: 0x008 to 0x02C */
    __IO uint32_t PBORCTL;          /*!< Brown-Out Reset Control,                                                           Address offset: 0x030          */
    __I  uint32_t LEGACY2[7];       /*!< Legacy Registers,                                                                  Address offset: 0x034 to 0x04C */
    __IO uint32_t RIS;              /*!< Raw Interrupt Status,                                                              Address offset: 0x050          */
    __IO uint32_t IMC;              /*!< Interrupt Mask Control,                                                            Address offset: 0x054          */
    __IO uint32_t MISC;             /*!< Masked Interrupt Status and Clear,                                                 Address offset: 0x058          */
    __IO uint32_t RESC;             /*!< Reset Cause,                                                                       Address offset: 0x05C          */
    __IO uint32_t RCC;              /*!< Run-Mode Clock Configuration,                                                      Address offset: 0x060          */
    __I  uint32_t RESERVED[2];      /*!< RESERVED,                                                                          Address offset: 0x064 to 0x068 */
    __IO uint32_t GPIOHBCTL;        /*!< GPIO High-Performance Bus Control,                                                 Address offset: 0x06C          */
    __IO uint32_t RCC2;             /*!< Run-Mode Clock Configuration 2,                                                    Address offset: 0x070          */
    __I  uint32_t RESERVED1[2];     /*!< RESERVED,                                                                          Address offset: 0x074 to 0x078 */
    __IO uint32_t MOSCCTL;          /*!< Main Oscillator Control,                                                           Address offset: 0x07C          */
    __I  uint32_t RESERVED2[32];    /*!< RESERVED,                                                                          Address offset: 0x080 to 0x0FC */
    __I  uint32_t LEGACY3[3];       /*!< Legacy Registers,                                                                  Address offset: 0x100 to 0x108 */
    __I  uint32_t RESERVED3;        /*!< RESERVED,                                                                          Address offset: 0x10C          */
    __I  uint32_t LEGACY4[3];       /*!< Legacy Registers,                                                                  Address offset: 0x110 to 0x118 */
    __I  uint32_t RESERVED4;        /*!< RESERVED,                                                                          Address offset: 0x11C          */
    __I  uint32_t LEGACY5[3];       /*!< Legacy Registers,                                                                  Address offset: 0x120 to 0x128 */
    __I  uint32_t RESERVED5[6];     /*!< RESERVED,                                                                          Address offset: 0x12C to 0x140 */
    __IO uint32_t DSLPCLKCFG;       /*!< Deep Sleep Clock Configuration,                                                    Address offset: 0x144          */
    __I  uint32_t RESERVED6;        /*!< RESERVED,                                                                          Address offset: 0x148          */
    __IO uint32_t SYSPROP;          /*!< System Properties,                                                                 Address offset: 0x14C          */
    __IO uint32_t PIOSCCAL;         /*!< Precision Internal Oscillator Calibration,                                         Address offset: 0x150          */
    __IO uint32_t PIOSCSTAT;        /*!< Precision Internal Oscillator Statistics,                                          Address offset: 0x154          */
    __I  uint32_t RESERVED7[2];     /*!< RESERVED,                                                                          Address offset: 0x158 to 0x15C */
    __IO uint32_t PLLFREQ0;         /*!< PLL Frequency 0,                                                                   Address offset: 0x160          */
    __IO uint32_t PLLFREQ1;         /*!< PLL Frequency 1,                                                                   Address offset: 0x164          */
    __IO uint32_t PLLSTAT;          /*!< PLL Status,                                                                        Address offset: 0x168          */
    __I  uint32_t RESERVED8[7];     /*!< RESERVED,                                                                          Address offset: 0x16C to 0x184 */
    __IO uint32_t SLPPWRCFG;        /*!< Sleep Power Configuration,                                                         Address offset: 0x188          */
    __IO uint32_t DSLPPWRCFG;       /*!< Deep-Sleep Power Configuration,                                                    Address offset: 0x18C          */
    __I  uint32_t LEGACY6;          /*!< Legacy Registers,                                                                  Address offset: 0x190          */
    __I  uint32_t RESERVED9[3];     /*!< RESERVED,                                                                          Address offset: 0x194 to 0x19C */
    __I  uint32_t LEGACY7;          /*!< Legacy Registers,                                                                  Address offset: 0x1A0          */
    __I  uint32_t RESERVED10[4];    /*!< RESERVED,                                                                          Address offset: 0x1A4 to 0x1B0 */
    __IO uint32_t LDOSPCTL;         /*!< LDO Sleep Power Control,                                                           Address offset: 0x1B4          */
    __I  uint32_t LDOSPCAL;         /*!< LDO Sleep Power Calibration,                                                       Address offset: 0x1B8          */
    __IO uint32_t LDODPCTL;         /*!< LDO Deep-Sleep Power Control,                                                      Address offset: 0x1BC          */
    __IO uint32_t LDODPCAL;         /*!< LDO Deep-Sleep Power Calibration,                                                  Address offset: 0x1C0          */
    __I  uint32_t RESERVED11[2];    /*!< RESERVED,                                                                          Address offset: 0x1C4 to 0x1C8 */
    __IO uint32_t SDPMST;           /*!< Sleep / Deep-Sleep Power Mode Status,                                              Address offset: 0x1CC          */
    __I  uint32_t RESERVED12[76];   /*!< RESERVED,                                                                          Address offset: 0x1D0 to 0x2FC */
    __IO uint32_t PPWD;             /*!< Watchdog Timer Peripheral Present,                                                 Address offset: 0x300          */
    __IO uint32_t PPTIMER;          /*!< 16/32-Bit General-Purpose Timer Peripheral Present,                                Address offset: 0x304          */
    __IO uint32_t PPGPIO;           /*!< General-Purpose Input/Output Peripheral Present,                                   Address offset: 0x308          */
    __IO uint32_t PPDMA;            /*!< Micro Direct Memory Access Peripheral Present,                                     Address offset: 0x30C          */
    __I  uint32_t RESERVED13;       /*!< RESERVED,                                                                          Address offset: 0x310          */
    __IO uint32_t PPHIB;            /*!< Hibernation Peripheral Present,                                                    Address offset: 0x314          */
    __IO uint32_t PPUART;           /*!< Universal Asynchronous Receiver/Transmitter Peripheral Present,                    Address offset: 0x318          */
    __IO uint32_t PPSSI;            /*!< Synchronous Serial Interface Peripheral Present,                                   Address offset: 0x31C          */
    __IO uint32_t PPI2C;            /*!< Inter-Integrated Circuit Peripheral Present,                                       Address offset: 0x320          */
    __I  uint32_t RESERVED14;       /*!< RESERVED,                                                                          Address offset: 0x324          */
    __IO uint32_t PPUSB;            /*!< Universal Serial Bus Peripheral Present,                                           Address offset: 0x328          */
    __I  uint32_t RESERVED15[2];    /*!< RESERVED,                                                                          Address offset: 0x32C to 0x330 */
    __IO uint32_t PPCAN;            /*!< Controller Area Network Peripheral Present,                                        Address offset: 0x334          */
    __IO uint32_t PPADC;            /*!< Analog-to-Digital Converter Peripheral Present,                                    Address offset: 0x338          */
    __IO uint32_t PPACMP;           /*!< Analog Comparator Peripheral Present,                                              Address offset: 0x33C          */
    __IO uint32_t PPPWM;            /*!< Pulse Width Modulator Peripheral Present,                                          Address offset: 0x340          */
    __IO uint32_t PPQEI;            /*!< Quadrature Encoder Interface Peripheral Present,                                   Address offset: 0x344          */
    __I  uint32_t RESERVED16[4];    /*!< RESERVED,                                                                          Address offset: 0x348 to 0x354 */
    __IO uint32_t PPEEPROM;         /*!< EEPROM Peripheral Present,                                                         Address offset: 0x358          */
    __IO uint32_t PPWTIMER;         /*!< 32/64-Bit Wide General-Purpose Timer Peripheral Present,                           Address offset: 0x35C          */
    __I  uint32_t RESERVED17[104];  /*!< RESERVED,                                                                          Address offset: 0x360 to 0x4FC */
    __IO uint32_t SRWD;             /*!< Watchdog Timer Software Reset,                                                     Address offset: 0x500          */
    __IO uint32_t SRTIMER;          /*!< 16/32-Bit General-Purpose Timer Software Reset,                                    Address offset: 0x504          */
    __IO uint32_t SRGPIO;           /*!< General-Purpose Input/Output Software Reset,                                       Address offset: 0x508          */
    __IO uint32_t SRDMA;            /*!< Micro Direct Memory Access Software Reset,                                         Address offset: 0x50C          */
    __I  uint32_t RESERVED18;       /*!< RESERVED,                                                                          Address offset: 0x510          */
    __IO uint32_t SRHIB;            /*!< Hibernation Software Reset,                                                        Address offset: 0x514          */
    __IO uint32_t SRUART;           /*!< Universal Asynchronous Receiver/Transmitter Software Reset,                        Address offset: 0x518          */
    __IO uint32_t SRSSI;            /*!< Synchronous Serial Interface Software Reset,                                       Address offset: 0x51C          */
    __IO uint32_t SRI2C;            /*!< Inter-Integrated Circuit Software Reset,                                           Address offset: 0x520          */
    __I  uint32_t RESERVED19;       /*!< RESERVED,                                                                          Address offset: 0x524          */
    __IO uint32_t SRUSB;            /*!< Universal Serial Bus Software Reset,                                               Address offset: 0x528          */
    __I  uint32_t RESERVED20[2];    /*!< RESERVED,                                                                          Address offset: 0x52C to 0x530 */
    __IO uint32_t SRCAN;            /*!< Controller Area Network Software Reset,                                            Address offset: 0x534          */
    __IO uint32_t SRADC;            /*!< Analog-to-Digital Converter Software Reset,                                        Address offset: 0x538          */
    __IO uint32_t SRACMP;           /*!< Analog Comparator Software Reset,                                                  Address offset: 0x53C          */
    __IO uint32_t SRPWM;            /*!< Pulse Width Modulator Software Reset,                                              Address offset: 0x540          */
    __IO uint32_t SRQEI;            /*!< Quadrature Encoder Interface Software Reset,                                       Address offset: 0x544          */
    __I  uint32_t RESERVED21[4];    /*!< RESERVED,                                                                          Address offset: 0x548 to 0x554 */
    __IO uint32_t SREEPROM;         /*!< EEPROM Software Reset,                                                             Address offset: 0x558          */
    __IO uint32_t SRWTIMER;         /*!< 32/64-Bit Wide General-Purpose Timer Software Reset,                               Address offset: 0x55C          */
    __I  uint32_t RESERVED22[40];   /*!< RESERVED,                                                                          Address offset: 0x560 to 0x5FC */
    __IO uint32_t RCGCWD;           /*!< Watchdog Timer Run Mode Clock Gating Control,                                      Address offset: 0x600          */
    __IO uint32_t RCGCTIMER;        /*!< 16/32-Bit General-Purpose Timer Run Mode Clock Gating Control,                     Address offset: 0x604          */
    __IO uint32_t RCGCGPIO;         /*!< General-Purpose Input/Output Run Mode Clock Gating Control,                        Address offset: 0x608          */
    __IO uint32_t RCGCDMA;          /*!< Micro Direct Memory Access Run Mode Clock Gating Control,                          Address offset: 0x60C          */
    __I  uint32_t RESERVED23;       /*!< RESERVED,                                                                          Address offset: 0x610          */
    __IO uint32_t RCGCHIB;          /*!< Hibernation Run Mode Clock Gating Control,                                         Address offset: 0x614          */
    __IO uint32_t RCGCUART;         /*!< Universal Asynchronous Receiver/Transmitter Run Mode Clock Gating Control,         Address offset: 0x618          */
    __IO uint32_t RCGCSSI;          /*!< Synchronous Serial Interface Run Mode Clock Gating Control,                        Address offset: 0x61C          */
    __IO uint32_t RCGCI2C;          /*!< Inter-Integrated Circuit Run Mode Clock Gating Control,                            Address offset: 0x620          */
    __I  uint32_t RESERVED24;       /*!< RESERVED,                                                                          Address offset: 0x624          */
    __IO uint32_t RCGCUSB;          /*!< Universal Serial Bus Run Mode Clock Gating Control,                                Address offset: 0x628          */
    __I  uint32_t RESERVED25[2];    /*!< RESERVED,                                                                          Address offset: 0x62C to 0x630 */
    __IO uint32_t RCGCCAN;          /*!< Controller Area Network Run Mode Clock Gating Control,                             Address offset: 0x634          */
    __IO uint32_t RCGCADC;          /*!< Analog-to-Digital Converter Run Mode Clock Gating Control,                         Address offset: 0x638          */
    __IO uint32_t RCGCACMP;         /*!< Analog Comparator Run Mode Clock Gating Control,                                   Address offset: 0x63C          */
    __IO uint32_t RCGCPWM;          /*!< Pulse Width Modulator Run Mode Clock Gating Control,                               Address offset: 0x640          */
    __IO uint32_t RCGCQEI;          /*!< Quadrature Encoder Interface Run Mode Clock Gating Control,                        Address offset: 0x644          */
    __I  uint32_t RESERVED26[4];    /*!< RESERVED,                                                                          Address offset: 0x648 to 0x654 */
    __IO uint32_t RCGCEEPROM;       /*!< EEPROM Run Mode Clock Gating Control,                                              Address offset: 0x658          */
    __IO uint32_t RCGCWTIMER;       /*!< 32/64-Bit Wide General-Purpose Timer Run Mode Clock Gating Control,                Address offset: 0x65C          */
    __I  uint32_t RESERVED27[40];   /*!< RESERVED,                                                                          Address offset: 0x660 to 0x6FC */
    __IO uint32_t SCGCWD;           /*!< Watchdog Timer Sleep Mode Clock Gating Control,                                    Address offset: 0x700          */
    __IO uint32_t SCGCTIMER;        /*!< 16/32-Bit General-Purpose Timer Sleep Mode Clock Gating Control,                   Address offset: 0x704          */
    __IO uint32_t SCGCGPIO;         /*!< General-Purpose Input/Output Sleep Mode Clock Gating Control,                      Address offset: 0x708          */
    __IO uint32_t SCGCDMA;          /*!< Micro Direct Memory Access Sleep Mode Clock Gating Control,                        Address offset: 0x70C          */
    __I  uint32_t RESERVED28;       /*!< RESERVED,                                                                          Address offset: 0x710          */
    __IO uint32_t SCGCHIB;          /*!< Hibernation Sleep Mode Clock Gating Control,                                       Address offset: 0x714          */
    __IO uint32_t SCGCUART;         /*!< Universal Asynchronous Receiver/Transmitter Sleep Mode Clock Gating Control,       Address offset: 0x718          */
    __IO uint32_t SCGCSSI;          /*!< Synchronous Serial Interface Sleep Mode Clock Gating Control,                      Address offset: 0x71C          */
    __IO uint32_t SCGCI2C;          /*!< Inter-Integrated Circuit Sleep Mode Clock Gating Control,                          Address offset: 0x720          */
    __I  uint32_t RESERVED29;       /*!< RESERVED,                                                                          Address offset: 0x724          */
    __IO uint32_t SCGCUSB;          /*!< Universal Serial Bus Sleep Mode Clock Gating Control,                              Address offset: 0x728          */
    __I  uint32_t RESERVED30[2];    /*!< RESERVED,                                                                          Address offset: 0x72C to 0x730 */
    __IO uint32_t SCGCCAN;          /*!< Controller Area Network Sleep Mode Clock Gating Control,                           Address offset: 0x734          */
    __IO uint32_t SCGCADC;          /*!< Analog-to-Digital Converter Sleep Mode Clock Gating Control,                       Address offset: 0x738          */
    __IO uint32_t SCGCACMP;         /*!< Analog Comparator Sleep Mode Clock Gating Control,                                 Address offset: 0x73C          */
    __IO uint32_t SCGCPWM;          /*!< Pulse Width Modulator Sleep Mode Clock Gating Control,                             Address offset: 0x740          */
    __IO uint32_t SCGCQEI;          /*!< Quadrature Encoder Interface Sleep Mode Clock Gating Control,                      Address offset: 0x744          */
    __I  uint32_t RESERVED31[4];    /*!< RESERVED,                                                                          Address offset: 0x748 to 0x754 */
    __IO uint32_t SCGCEEPROM;       /*!< EEPROM Sleep Mode Clock Gating Control,                                            Address offset: 0x758          */
    __IO uint32_t SCGCWTIMER;       /*!< 32/64-Bit Wide General-Purpose Timer Sleep Mode Clock Gating Control,              Address offset: 0x75C          */
    __I  uint32_t RESERVED32[40];   /*!< RESERVED,                                                                          Address offset: 0x760 to 0x7FC */
    __IO uint32_t DCGCWD;           /*!< Watchdog Timer Deep-Sleep Mode Clock Gating Control,                               Address offset: 0x800          */
    __IO uint32_t DCGCTIMER;        /*!< 16/32-Bit General-Purpose Timer Deep-Sleep Mode Clock Gating Control,              Address offset: 0x804          */
    __IO uint32_t DCGCGPIO;         /*!< General-Purpose Input/Output Deep-Sleep Mode Clock Gating Control,                 Address offset: 0x808          */
    __IO uint32_t DCGCDMA;          /*!< Micro Direct Memory Access Deep-Sleep Mode Clock Gating Control,                   Address offset: 0x80C          */
    __I  uint32_t RESERVED33;       /*!< RESERVED,                                                                          Address offset: 0x810          */
    __IO uint32_t DCGCHIB;          /*!< Hibernation Deep-Sleep Mode Clock Gating Control,                                  Address offset: 0x814          */
    __IO uint32_t DCGCUART;         /*!< Universal Asynchronous Receiver/Transmitter Deep-Sleep Mode Clock Gating Control,  Address offset: 0x818          */
    __IO uint32_t DCGCSSI;          /*!< Synchronous Serial Interface Deep-Sleep Mode Clock Gating Control,                 Address offset: 0x81C          */
    __IO uint32_t DCGCI2C;          /*!< Inter-Integrated Circuit Deep-Sleep Mode Clock Gating Control,                     Address offset: 0x820          */
    __I  uint32_t RESERVED34;       /*!< RESERVED,                                                                          Address offset: 0x824          */
    __IO uint32_t DCGCUSB;          /*!< Universal Serial Bus Deep-Sleep Mode Clock Gating Control,                         Address offset: 0x828          */
    __I  uint32_t RESERVED35[2];    /*!< RESERVED,                                                                          Address offset: 0x82C to 0x230 */
    __IO uint32_t DCGCCAN;          /*!< Controller Area Network Deep-Sleep Mode Clock Gating Control,                      Address offset: 0x834          */
    __IO uint32_t DCGCADC;          /*!< Analog-to-Digital Converter Deep-Sleep Mode Clock Gating Control,                  Address offset: 0x838          */
    __IO uint32_t DCGCACMP;         /*!< Analog Comparator Deep-Sleep Mode Clock Gating Control,                            Address offset: 0x83C          */
    __IO uint32_t DCGCPWM;          /*!< Pulse Width Modulator Deep-Sleep Mode Clock Gating Control,                        Address offset: 0x840          */
    __IO uint32_t DCGCQEI;          /*!< Quadrature Encoder Interface Deep-Sleep Mode Clock Gating Control,                 Address offset: 0x844          */
    __I  uint32_t RESERVED36[4];    /*!< RESERVED,                                                                          Address offset: 0x848 to 0x854 */
    __IO uint32_t DCGCEEPROM;       /*!< EEPROM Deep-Sleep Mode Clock Gating Control,                                       Address offset: 0x858          */
    __IO uint32_t DCGCWTIMER;       /*!< 32/64-Bit Wide General-Purpose Timer Deep-Sleep Mode Clock Gating Control          Address offset: 0x85C          */
    __I  uint32_t RESERVED37[104];  /*!< RESERVED,                                                                          Address offset: 0x860 to 0x9FC */
    __IO uint32_t PRWD;             /*!< Watchdog Timer Peripheral Ready,                                                   Address offset: 0xA00          */
