adimalla/clTerm/Examples/Tiva_Launchpad_123gxl/custom_drivers/peripheral_drivers/inc/mcu_tm4c123gh6pm.h
    __IO uint32_t PRTIMER;          /*!< 16/32-Bit General-Purpose Timer Peripheral Ready,                                  Address offset: 0xA04          */
    __IO uint32_t PRGPIO;           /*!< General-Purpose Input/Output Peripheral Ready,                                     Address offset: 0xA08          */
    __IO uint32_t PRDMA;            /*!< Micro Direct Memory Access Peripheral Ready,                                       Address offset: 0xA0C          */
    __I  uint32_t RESERVED38;       /*!< RESERVED,                                                                          Address offset: 0xA10          */
    __IO uint32_t PRHIB;            /*!< Hibernation Peripheral Ready,                                                      Address offset: 0xA14          */
    __IO uint32_t PRUART;           /*!< Universal Asynchronous Receiver/Transmitter Peripheral Ready,                      Address offset: 0xA18          */
    __IO uint32_t PRSSI;            /*!< Synchronous Serial Interface Peripheral Ready,                                     Address offset: 0xA1C          */
    __IO uint32_t PRI2C;            /*!< Inter-Integrated Circuit Peripheral Ready,                                         Address offset: 0xA20          */
    __I  uint32_t RESERVED39;       /*!< RESERVED,                                                                          Address offset: 0xA24          */
    __IO uint32_t PRUSB;            /*!< Universal Serial Bus Peripheral Ready,                                             Address offset: 0xA28          */
    __I  uint32_t RESERVED40[2];    /*!< RESERVED,                                                                          Address offset: 0xA2C to 0x230 */
    __IO uint32_t PRCAN;            /*!< Controller Area Network Peripheral Ready,                                          Address offset: 0xA34          */
    __IO uint32_t PRADC;            /*!< Analog-to-Digital Converter Peripheral Ready,                                      Address offset: 0xA38          */
    __IO uint32_t PRACMP;           /*!< Analog Comparator Peripheral Ready,                                                Address offset: 0xA3C          */
    __IO uint32_t PRPWM;            /*!< Pulse Width Modulator Peripheral Ready,                                            Address offset: 0xA40          */
    __IO uint32_t PRQEI;            /*!< Quadrature Encoder Interface Peripheral Ready,                                     Address offset: 0xA44          */
    __I  uint32_t RESERVED41[4];    /*!< RESERVED,                                                                          Address offset: 0xA48 to 0xA54 */
    __IO uint32_t PREEPROM;         /*!< EEPROM Peripheral Ready,                                                           Address offset: 0xA58          */
    __IO uint32_t PRWTIMER;         /*!< 32/64-Bit Wide General-Purpose Timer Peripheral Ready,                             Address offset: 0xA5C          */

} sysctl_t;



/*
 * @brief System Control Legacy Register Structure
 */
typedef struct system_control_legacy
{
    __I  uint32_t RESERVED[2];    /*!< RESERVED,                                         Address offset: 0x000 to 0x004 */
    __IO uint32_t DC0;            /*!< Device Capabilities 0,                            Address offset: 0x008          */
    __I  uint32_t RESERVED1;      /*!< RESERVED,                                         Address offset: 0x00C          */
    __IO uint32_t DC1;            /*!< Device Capabilities 1,                            Address offset: 0x010          */
    __IO uint32_t DC2;            /*!< Device Capabilities 2,                            Address offset: 0x014          */
    __IO uint32_t DC3;            /*!< Device Capabilities 3,                            Address offset: 0x018          */
    __IO uint32_t DC4;            /*!< Device Capabilities 4,                            Address offset: 0x01C          */
    __IO uint32_t DC5;            /*!< Device Capabilities 5,                            Address offset: 0x020          */
    __IO uint32_t DC6;            /*!< Device Capabilities 6,                            Address offset: 0x024          */
    __IO uint32_t DC7;            /*!< Device Capabilities 7,                            Address offset: 0x028          */
    __IO uint32_t DC8;            /*!< Device Capabilities 8                             Address offset: 0x02C          */
    __I  uint32_t RESERVED2[4];   /*!< RESERVED,                                         Address offset: 0x030 to 0x03C */
    __IO uint32_t SRCR0;          /*!< Software Reset Control 0,                         Address offset: 0x040          */
    __IO uint32_t SRCR1;          /*!< Software Reset Control 1,                         Address offset: 0x044          */
    __IO uint32_t SRCR2;          /*!< Software Reset Control 2,                         Address offset: 0x048          */
    __I  uint32_t RESERVED3[45];  /*!< RESERVED,                                         Address offset: 0x04C to 0x0FC */
    __IO uint32_t RCGC0;          /*!< Run Mode Clock Gating Control Register 0,         Address offset: 0x100          */
    __IO uint32_t RCGC1;          /*!< Run Mode Clock Gating Control Register 1,         Address offset: 0x104          */
    __IO uint32_t RCGC2;          /*!< Run Mode Clock Gating Control Register 2,         Address offset: 0x108          */
    __I  uint32_t RESERVED4;      /*!< RESERVED,                                         Address offset: 0x10C          */
    __IO uint32_t SCGC0;          /*!< Sleep Mode Clock Gating Control Register 0,       Address offset: 0x110          */
    __IO uint32_t SCGC1;          /*!< Sleep Mode Clock Gating Control Register 1,       Address offset: 0x114          */
    __IO uint32_t SCGC2;          /*!< Sleep Mode Clock Gating Control Register 2,       Address offset: 0x118          */
    __I  uint32_t RESERVED5;      /*!< RESERVED,                                         Address offset: 0x11C          */
    __IO uint32_t DCGC0;          /*!< Deep Sleep Mode Clock Gating Control Register 0,  Address offset: 0x120          */
    __IO uint32_t DCGC1;          /*!< Deep-Sleep Mode Clock Gating Control Register 1,  Address offset: 0x124          */
    __IO uint32_t DCGC2;          /*!< Deep Sleep Mode Clock Gating Control Register 2,  Address offset: 0x128          */
    __I  uint32_t RESERVED6[25];  /*!< RESERVED,                                         Address offset: 0x12C to 0x18C */
    __IO uint32_t DC9;            /*!< Device Capabilities 9,                            Address offset: 0x190          */
    __I  uint32_t RESERVED7[3];   /*!< RESERVED,                                         Address offset: 0x194 to 0x19C */
    __IO uint32_t NVMSTAT;        /*!< Non-Volatile Memory Information,                  Address offset: 0x1A0          */

