adimalla/clTerm/Examples/Tiva_Launchpad_123gxl/custom_drivers/peripheral_drivers/inc/mcu_tm4c123gh6pm.h
} sysctl_legacy_t;



/*
 * @brief General-Purpose Input/Outputs Register Structure
 * TODO complete Address offsets docs
 */
typedef struct gpio_port
{
    __I  uint32_t BITMASK[255];  /*!< GPIO [9:2] register mask space, see Data Sheet,  Address offset: 0x3FC */
    __IO uint32_t DATA;          /*!< GPIO Data,                                       Address offset: 0x400 */
    __IO uint32_t DIR;           /*!< GPIO Direction,                                  Address offset: 0x404 */
    __IO uint32_t IS;            /*!< GPIO Interrupt Sense,                            Address offset: 0x408 */
    __IO uint32_t IBE;           /*!< GPIO Interrupt Both Edges,                       Address offset: 0x40C */
    __IO uint32_t IEV;           /*!< GPIO Interrupt Event,                            Address offset: 0x410 */
    __IO uint32_t IM;            /*!< GPIO Interrupt Mask,                             Address offset: 0x414 */
    __IO uint32_t RIS;           /*!< GPIO Raw Interrupt Status,                       Address offset: 0x418 */
    __IO uint32_t MIS;           /*!< GPIO Masked Interrupt Status,                    Address offset: 0x41C */
    __O  uint32_t ICR;           /*!< GPIO Interrupt Clear,                            Address offset: 0x420 */
    __IO uint32_t AFSEL;         /*!< GPIO Alternate Function Select,                  Address offset: 0x400 */
    __I  uint32_t RESERVED[55];  /*!< RESERVED,                                        Address offset: 0x000 */
    __IO uint32_t DR2R;          /*!< GPIO 2-mA Drive Select,                          Address offset: 0x000 */
    __IO uint32_t DR4R;          /*!< GPIO 4-mA Drive Select,                          Address offset: 0x000 */
    __IO uint32_t DR8R;          /*!< GPIO 8-mA Drive Select,                          Address offset: 0x000 */
    __IO uint32_t ODR;           /*!< GPIO Open Drain Select,                          Address offset: 0x000 */
    __IO uint32_t PUR;           /*!< GPIO Pull-Up Select,                             Address offset: 0x000 */
    __IO uint32_t PDR;           /*!< GPIO Pull-Down Select,                           Address offset: 0x000 */
    __IO uint32_t SLR;           /*!< GPIO Slew Rate Control Select,                   Address offset: 0x000 */
    __IO uint32_t DEN;           /*!< GPIO Digital Enable,                             Address offset: 0x000 */
    __IO uint32_t LOCK;          /*!< GPIO Lock,                                       Address offset: 0x000 */
    __IO uint32_t CR;            /*!< GPIO Commit,                                     Address offset: 0x000 */
    __IO uint32_t AMSEL;         /*!< GPIO Analog Mode Select,                         Address offset: 0x000 */
    __IO uint32_t PCTL;          /*!< GPIO Port Control,                               Address offset: 0x000 */
    __IO uint32_t ADCCTL;        /*!< GPIO ADC Control,                                Address offset: 0x000 */
    __IO uint32_t DMACTL;        /*!< GPIO DMA Control,                                Address offset: 0x000 */

} gpio_port_t;


/**
  * @brief Synchronous Serial Interface peripheral (SSI) Register Structure
  */

typedef struct ssi_periheral
{
  __IO uint32_t  CR0;             /*!< SSI Control 0,                Address offset: 0x000          */
  __IO uint32_t  CR1;             /*!< SSI Control 1,                Address offset: 0x004          */
  __IO uint32_t  DR;              /*!< SSI Data,                     Address offset: 0x008          */
  __IO uint32_t  SR;              /*!< SSI Status,                   Address offset: 0x00C          */
  __IO uint32_t  CPSR;            /*!< SSI Clock Prescale,           Address offset: 0x010          */
  __IO uint32_t  IM;              /*!< SSI Interrupt Mask,           Address offset: 0x014          */
  __IO uint32_t  RIS;             /*!< SSI Raw Interrupt Status,     Address offset: 0x018          */
  __IO uint32_t  MIS;             /*!< SSI Masked Interrupt Status,  Address offset: 0x01C          */
  __O  uint32_t  ICR;             /*!< SSI Interrupt Clear,          Address offset: 0x020          */
  __IO uint32_t  DMACTL;          /*!< SSI DMA Control,              Address offset: 0x024          */
  __I  uint32_t  RESERVED[1000];  /*!< RESERVED,                     Address offset: 0x028 to 0xFC4 */
  __IO uint32_t  CC;              /*!< SSI Clock Configuration       Address offset: 0xFC8          */

} ssi_periph_t;



typedef union uart_rsr_ecr
{
    __I  uint32_t  RSR;            /*!< UART Receive Status/Error Clear                                       */
    __IO uint32_t  ECR_UART_ALT;   /*!< UART Receive Status/Error Clear                                       */

} uart_rsr_ecr_t;


typedef struct uart_peripheral
{
    __IO uint32_t  DR;              /*!< UART Data                                                             */
    uart_rsr_ecr_t RSR_ECR;         /*!< UART Receive and Error status clear                                   */
    __I  uint32_t  RESERVED[4];     /*!< RESERVED,                                       Address offset: 0x000 */
    __IO uint32_t  FR;              /*!< UART Flag                                                             */
    __I  uint32_t  RESERVED1;       /*!< RESERVED,                                       Address offset: 0x000 */
    __IO uint32_t  ILPR;            /*!< UART IrDA Low-Power Register                                          */
    __IO uint32_t  IBRD;            /*!< UART Integer Baud-Rate Divisor                                        */
    __IO uint32_t  FBRD;            /*!< UART Fractional Baud-Rate Divisor                                     */
    __IO uint32_t  LCRH;            /*!< UART Line Control                                                     */
    __IO uint32_t  CTL;             /*!< UART Control                                                          */
    __IO uint32_t  IFLS;            /*!< UART Interrupt FIFO Level Select                                      */
    __IO uint32_t  IM;              /*!< UART Interrupt Mask                                                   */
    __IO uint32_t  RIS;             /*!< UART Raw Interrupt Status                                             */
    __IO uint32_t  MIS;             /*!< UART Masked Interrupt Status                                          */
    __O  uint32_t  ICR;             /*!< UART Interrupt Clear                                                  */
    __IO uint32_t  DMACTL;          /*!< UART DMA Control                                                      */
    __I  uint32_t  RESERVED2[22];   /*!< RESERVED,                                       Address offset: 0x000 */
    __IO uint32_t  UART9BITADDR;    /*!< UART 9-Bit Self Address                                               */
    __IO uint32_t  UART9BITAMASK;   /*!< UART 9-Bit Self Address Mask                                          */
    __I  uint32_t  RESERVED3[965];  /*!< RESERVED,                                       Address offset: 0x000 */
    __IO uint32_t  PP;              /*!< UART Peripheral Properties                                            */
    __I  uint32_t  RESERVED4;       /*!< RESERVED,                                       Address offset: 0x000 */
    __IO uint32_t  CC;              /*!< UART Clock Configuration                                              */

} uart_periph_t;




/***************************************************************************/
/*                                                                         */
/*                       Device Peripheral Definitions                     */
/*                                                                         */
/***************************************************************************/


