adimalla/clTerm/Examples/Tiva_Launchpad_123gxl/custom_drivers/peripheral_drivers/inc/mcu_tm4c123gh6pm.h
/*
 * @brief Peripheral Declarations
 */
#define GPIOA                    ((gpio_port_t *) GPIOA_BASEADDR)
#define GPIOB                    ((gpio_port_t *) GPIOB_BASEADDR)
#define GPIOC                    ((gpio_port_t *) GPIOC_BASEADDR)
#define GPIOD                    ((gpio_port_t *) GPIOD_BASEADDR)
#define GPIOE                    ((gpio_port_t *) GPIOE_BASEADDR)
#define GPIOF                    ((gpio_port_t *) GPIOF_BASEADDR)

#define GPIOA_AHB                ((gpio_port_t *) GPIOA_AHB_BASEADDR)
#define GPIOB_AHB                ((gpio_port_t *) GPIOB_AHB_BASEADDR)
#define GPIOC_AHB                ((gpio_port_t *) GPIOC_AHB_BASEADDR)
#define GPIOD_AHB                ((gpio_port_t *) GPIOD_AHB_BASEADDR)
#define GPIOE_AHB                ((gpio_port_t *) GPIOE_AHB_BASEADDR)
#define GPIOF_AHB                ((gpio_port_t *) GPIOF_AHB_BASEADDR)

#define SSI0                     ((ssi_periph_t *) SSI0_BASEADDR)
#define SSI1                     ((ssi_periph_t *) SSI1_BASEADDR)
#define SSI2                     ((ssi_periph_t *) SSI2_BASEADDR)
#define SSI3                     ((ssi_periph_t *) SSI3_BASEADDR)

#define UART0                    ((uart_periph_t *) UART0_BASEADDR)
#define UART1                    ((uart_periph_t *) UART1_BASEADDR)
#define UART2                    ((uart_periph_t *) UART2_BASEADDR)
#define UART3                    ((uart_periph_t *) UART3_BASEADDR)
#define UART4                    ((uart_periph_t *) UART4_BASEADDR)
#define UART5                    ((uart_periph_t *) UART5_BASEADDR)
#define UART6                    ((uart_periph_t *) UART6_BASEADDR)
#define UART7                    ((uart_periph_t *) UART7_BASEADDR)

#define SYSCTL                   ((sysctl_t        *) SYSCTL_BASEADDR)
#define SYSCTL_LEGACY            ((sysctl_legacy_t *) SYSCTL_BASEADDR)

#define NVIC                     ((NVIC_T          *) NVIC_BASEADDR)




#endif /* MAIN_TM4C123GH6PM_H_ */
